-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Май 08 2026 г., 11:20
-- Версия сервера: 8.0.34-26-beget-1-1
-- Версия PHP: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `ivanbohg_test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `additional_data`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 15:16
--

DROP TABLE IF EXISTS `additional_data`;
CREATE TABLE `additional_data` (
  `id` int NOT NULL,
  `additional_date` date DEFAULT NULL,
  `additional_content` text,
  `creator_surname` varchar(255) DEFAULT NULL,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `additional_data`
--

INSERT INTO `additional_data` (`id`, `additional_date`, `additional_content`, `creator_surname`, `serial_number`, `case_number`, `created_at`) VALUES
(1, '2026-05-06', 'Прибор работает в городе Октябрьский', 'Админ', '109', '008-2024', '2026-05-05 15:15:40'),
(2, '2026-05-06', 'Прибор возвращается в город Самара', 'Админ', '109', '008-2024', '2026-05-05 15:16:11');

-- --------------------------------------------------------

--
-- Структура таблицы `device_composition`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 15:54
--

DROP TABLE IF EXISTS `device_composition`;
CREATE TABLE `device_composition` (
  `id` int NOT NULL,
  `device_id` int NOT NULL,
  `board_name` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `version` varchar(255) DEFAULT NULL,
  `serial_number` varchar(255) DEFAULT NULL,
  `creator_id` int DEFAULT NULL COMMENT 'ID пользователя-создателя',
  `creator_name` varchar(255) DEFAULT NULL COMMENT 'ФИО создателя записи',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `device_composition`
--

INSERT INTO `device_composition` (`id`, `device_id`, `board_name`, `type`, `version`, `serial_number`, `creator_id`, `creator_name`, `created_at`) VALUES
(11, 2, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS (неуменьшенная)', '2', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(12, 2, 'Транзитная', 'неукороченная несимметричная', '2', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(13, 2, 'AL_V1.0', 'Сбора и хранения данных (старая плата, неуменьшенная))', '1', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(14, 2, '1DDS', 'АЦП, DDS', '3', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(15, 2, 'ПРМ-ЛВД-1DDS', 'УВЧ приёмника (неуменьшенная)', '1', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(16, 2, 'Передатчик', 'уменьшенная плата (источник 6В на плате)', '-', '-', 7, 'Администратор', '2025-06-02 22:33:52'),
(17, 3, 'Транзитная', 'неукороченная несимметричная, с стабилизатором 6В', '2', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 15:41:41'),
(18, 3, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS (неуменьшенная)', '1', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 15:41:41'),
(19, 3, 'AL_V1.0', 'Сбора и хранения данных (старая плата, неуменьшенная))', '1', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 15:41:41'),
(20, 3, '1DDS', 'АЦП, DDS (перенесена от середины прибора)', '', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 15:41:41'),
(21, 3, 'Передатчик', 'неуменьшенная плата (источник 6В на транзитке)', '', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 15:41:41'),
(22, 4, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS (уменьшенная)', '', '', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(23, 4, 'Транзитная', 'неукороченная несимметричная', '', '', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(24, 4, 'AL_V1.0', 'плата старой версии', '', '', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(25, 4, '1DDS', 'АЦП, DDS', '3', '-', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(26, 4, 'ПРМ-ЛВД-1DDS', 'уменьшенная, УВЧ', '', '', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(27, 4, 'Передатчик', 'Т3, Т1, Т2 неукороченая без источника 6В. Т4 укороченная, с источником 6В', '', '', 26, 'Литвинов Владислав Глебович', '2025-06-05 16:46:06'),
(40, 7, 'транзитная', 'старого типа, маленькая, под 3DDS', '1', '000', 26, 'Литвинов Владислав Глебович', '2025-09-12 10:53:02'),
(41, 19, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS (уменьшенная)', '', '', NULL, NULL, '2026-05-04 13:58:56'),
(42, 19, 'Транзитная', 'неукороченная несимметричная', '', '', NULL, NULL, '2026-05-04 13:58:56'),
(43, 19, 'AL_V1.0', 'плата старой версии', '', '', NULL, NULL, '2026-05-04 13:58:56'),
(44, 19, '1DDS', 'АЦП, DDS', '3', '-', NULL, NULL, '2026-05-04 13:58:56'),
(45, 19, 'ПРМ-ЛВД-1DDS', 'уменьшенная, УВЧ', '', '', NULL, NULL, '2026-05-04 13:58:56'),
(46, 19, 'Передатчик', 'Т3, Т1, Т2 неукороченая без источника 6В. Т4 укороченная, с источником 6В', '', '', NULL, NULL, '2026-05-04 13:58:56'),
(47, 20, 'транзитная', 'старого типа, маленькая, под 3DDS', '1', '000', NULL, NULL, '2026-05-04 14:15:32'),
(54, 1, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS', '2', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(55, 1, 'Транзитная', 'укороченная несимметричная', '2', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(56, 1, 'AL_V3', 'Сбора и хранения данных (Олег)', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(57, 1, '1DDS', 'АЦП, DDS', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(58, 1, 'ПРМ-ЛВД-1DDS', 'УВЧ приёмника', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(59, 1, 'Передатчик', 'уменьшенная плата (источник 6В на плате)', '4', '-', 7, 'Админ', '2026-05-05 15:54:48');

-- --------------------------------------------------------

--
-- Структура таблицы `device_composition_history`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 15:54
--

DROP TABLE IF EXISTS `device_composition_history`;
CREATE TABLE `device_composition_history` (
  `id` int NOT NULL,
  `device_id` int NOT NULL,
  `board_name` varchar(255) NOT NULL,
  `type` varchar(100) NOT NULL,
  `version` varchar(100) NOT NULL,
  `serial_number` varchar(100) NOT NULL,
  `creator_id` int DEFAULT NULL COMMENT 'ID пользователя-создателя',
  `creator_name` varchar(255) DEFAULT NULL COMMENT 'ФИО создателя записи',
  `changed_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `device_composition_history`
--

INSERT INTO `device_composition_history` (`id`, `device_id`, `board_name`, `type`, `version`, `serial_number`, `creator_id`, `creator_name`, `changed_at`) VALUES
(1, 1, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS', '2', '-', 7, 'Администратор', '2025-06-02 22:04:34'),
(2, 1, 'Транзитная', 'укороченная несимметричная', '2', '-', 7, 'Администратор', '2025-06-02 22:04:34'),
(3, 1, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS', '2', '-', 7, 'Администратор', '2025-06-02 22:08:57'),
(4, 1, 'Транзитная', 'укороченная несимметричная', '2', '-', 7, 'Администратор', '2025-06-02 22:08:57'),
(5, 1, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS', '2', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(6, 1, 'Транзитная', 'укороченная несимметричная', '2', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(7, 1, 'AL_V3', 'Сбора и хранения данных (Олег)', '3', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(8, 1, '1DDS', 'АЦП, DDS', '3', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(9, 1, 'ПРМ-ЛВД-1DDS', 'УВЧ приёмника', '2', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(10, 1, 'Передатчик', 'уменьшенная плата (источник 6В на плате)', '-', '-', 7, 'Админ', '2026-05-05 15:54:42'),
(11, 1, 'УВЧ приёмника', 'ПРН-ЛВД-1DDS', '2', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(12, 1, 'Транзитная', 'укороченная несимметричная', '2', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(13, 1, 'AL_V3', 'Сбора и хранения данных (Олег)', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(14, 1, '1DDS', 'АЦП, DDS', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(15, 1, 'ПРМ-ЛВД-1DDS', 'УВЧ приёмника', '3', '-', 7, 'Админ', '2026-05-05 15:54:48'),
(16, 1, 'Передатчик', 'уменьшенная плата (источник 6В на плате)', '2', '-', 7, 'Админ', '2026-05-05 15:54:48');

-- --------------------------------------------------------

--
-- Структура таблицы `device_history`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 17:39
--

DROP TABLE IF EXISTS `device_history`;
CREATE TABLE `device_history` (
  `history_id` int NOT NULL,
  `device_id` int NOT NULL,
  `device_type` varchar(255) DEFAULT NULL,
  `nominal_diameter` varchar(255) DEFAULT NULL,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL,
  `length_mm` varchar(255) DEFAULT NULL,
  `diameter_mm` varchar(255) DEFAULT NULL,
  `upper_thread` varchar(255) DEFAULT NULL,
  `lower_thread` varchar(255) DEFAULT NULL,
  `frequency1_khz` varchar(255) DEFAULT NULL,
  `frequency2_khz` varchar(255) DEFAULT NULL,
  `receiver_base1_mm` varchar(255) DEFAULT NULL,
  `receiver_base2_mm` varchar(255) DEFAULT NULL,
  `receiver_base3_mm` varchar(255) DEFAULT NULL,
  `record_date` varchar(255) DEFAULT NULL,
  `creator_lastname` varchar(255) DEFAULT NULL,
  `changed_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `transmitter_base1_mm` varchar(255) DEFAULT NULL,
  `transmitter_base2_mm` varchar(255) DEFAULT NULL,
  `transmitter_base3_mm` varchar(255) DEFAULT NULL,
  `transmitter_base4_mm` varchar(255) DEFAULT NULL,
  `transmitter_base5_mm` varchar(255) DEFAULT NULL,
  `additional_info` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `device_history`
--

INSERT INTO `device_history` (`history_id`, `device_id`, `device_type`, `nominal_diameter`, `serial_number`, `case_number`, `length_mm`, `diameter_mm`, `upper_thread`, `lower_thread`, `frequency1_khz`, `frequency2_khz`, `receiver_base1_mm`, `receiver_base2_mm`, `receiver_base3_mm`, `record_date`, `creator_lastname`, `changed_at`, `transmitter_base1_mm`, `transmitter_base2_mm`, `transmitter_base3_mm`, `transmitter_base4_mm`, `transmitter_base5_mm`, `additional_info`) VALUES
(1, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '1', NULL, NULL, '2025-06-02', 'Администратор', '2025-06-02 22:04:34', '1', '1', '1', '1', NULL, NULL),
(2, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Администратор', '2025-06-02 22:08:57', '471', '848', '1228', '1600', NULL, NULL),
(3, 2, 'LWD', '120', '108', '005-2024', '1.00', '1.00', '1', '1', '1.00', '1.00', '1', NULL, NULL, '2025-06-02', 'Администратор', '2025-06-02 22:33:52', '1', '1', '1', '1', NULL, NULL),
(4, 3, 'LWD', '120', '106', '003-2023', '3903.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-05', 'Литвинов Владислав Глебович', '2025-06-05 15:41:41', '472', '847', '1228', '1604', NULL, NULL),
(5, 4, 'LWD', '120', '105', '002-2023', '4140.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '254', NULL, NULL, '0000-00-00', 'Литвинов Владислав Глебович', '2025-06-05 16:46:06', '470', '846', '1230', '1605', NULL, NULL),
(6, 7, 'Автономный', '90', '151001', '045-2023', '', '', '', '', '', '', '', '', '', '2025-09-12', 'Литвинов Владислав Глебович', '2025-09-12 10:53:02', '', '', '', '', '', 'Прибор собран по схеме индукторов из провода. Индукторы приемника мотались проводом 0.35, 13 витков один к одному с зазором в 3 толщины провода от края желоба. Индукторы передатчика мотались проводом 0.5, 6 витков с зазором в одну толщину провода между витками и от края желоба.'),
(7, 8, 'Автономный', '90', '0410', '041-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '254', '', '', '2025-11-05', 'Литвинов Владислав Глебович', '2025-11-06 15:05:09', '470', '846', '1228', '1605', '', '!!!Внимание!!! S/N, размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(8, 9, 'Автономный', '90', '0450', '045-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '254', '', '', '0000-00-00', 'Литвинов Владислав Глебович', '2025-11-06 15:05:31', '470', '846', '1228', '', '', '!!!Внимание!!! S/N, размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(9, 9, 'Автономный', '90', '415', '045-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '254', '', '', '0000-00-00', 'Литвинов Владислав Глебович', '2025-11-06 15:05:51', '470', '846', '1228', NULL, NULL, '!!!Внимание!!! размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(10, 8, 'Автономный', '90', '415', '041-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '254', '', '', '2025-11-05', 'Литвинов Владислав Глебович', '2025-11-06 15:06:01', '470', '846', '1228', '1605', NULL, '!!!Внимание!!! S/N, размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(11, 10, 'Автономный', '90', '0360', '036-2020', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '254', '', '', '2025-11-05', 'Литвинов Владислав Глебович', '2025-11-06 15:06:21', '470', '846', '1228', '', '', '!!!Внимание!!! S/N, размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(12, 12, 'Картограф', '120', '351001', '005-2025', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '111', '222', '333', '2025-12-24', 'Литвинов Владислав Глебович', '2025-12-24 08:08:58', '111', '222', '333', '444', '555', ''),
(13, 15, 'LWD', '120', '102', '003--2022', '', '', '', '', '', '', '', '', '', '2026-04-08', 'Литвинов Владислав Глебович', '2026-04-08 07:23:58', '', '', '', '', '', ''),
(14, 15, 'LWD', '120', '102', '003-2022', '2222', '120', 'МК-90', 'МК-90', '399.00', '1960.00', '111', '', '', '2026-04-08', 'Литвинов Владислав Глебович', '2026-04-08 08:06:57', '111', '222', '333', '444', '555', 'Прибор переделан в обычный LWD-индукционник из старого картографа.'),
(15, 15, 'LWD', '120', '102', '003-2022', '2222', '120', 'МК-90', 'МК-90', '401', '2001', '252', '', '', '2026-04-08', 'Литвинов Владислав Глебович', '2026-04-08 08:12:27', '812', '1224', '0', '0', '0', 'Прибор переделан в обычный LWD-индукционник из старого картографа.'),
(16, 4, 'LWD', '120', '105', '002-2023', '4140.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '254', NULL, NULL, '0000-00-00', 'Литвинов Владислав Глебович', '2026-04-16 07:17:42', '470', '846', '1230', '1605', NULL, NULL),
(17, 3, 'LWD', '120', '106', '003-2023', '3903.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-05', 'Литвинов Владислав Глебович', '2026-04-16 07:28:24', '472', '847', '1228', '1604', NULL, NULL),
(18, 2, 'LWD', '120', '108', '005-2024', '3920.00', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Литвинов Владислав Глебович', '2026-04-16 07:32:57', '446', '824', '1202', '1580', NULL, NULL),
(19, 2, 'LWD', '120', '108', '005-2024', '3920.00', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Литвинов Владислав Глебович', '2026-04-16 07:36:04', '318', '698', '1074', '1463', NULL, NULL),
(20, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 15:54:42', '471', '848', '1228', '1600', NULL, NULL),
(21, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 15:54:48', '471', '848', '1228', '1600', NULL, NULL),
(22, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 15:54:56', '471', '848', '1228', '1600', NULL, NULL),
(23, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '255', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 15:55:01', '471', '848', '1228', '1600', NULL, NULL),
(24, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '255', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 16:58:24', '471', '849', '1228', '1600', NULL, NULL),
(25, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 17:39:24', '471', '849', '1228', '1600', NULL, NULL),
(26, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 17:39:28', '471', '849', '1228', '1601', NULL, NULL),
(27, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 17:39:30', '471', '849', '1228', '1601', NULL, NULL),
(28, 1, 'LWD', '120', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '254', NULL, NULL, '2025-06-02', 'Админ', '2026-05-05 17:39:31', '471', '849', '1228', '1601', NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `device_identification`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 17:39
--

DROP TABLE IF EXISTS `device_identification`;
CREATE TABLE `device_identification` (
  `id` int NOT NULL,
  `device_type` varchar(255) NOT NULL,
  `nominal_diameter` varchar(255) NOT NULL,
  `transmitter_count` varchar(255) NOT NULL,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL,
  `length_mm` varchar(255) DEFAULT NULL,
  `diameter_mm` varchar(255) DEFAULT NULL,
  `upper_thread` varchar(255) DEFAULT NULL,
  `lower_thread` varchar(255) DEFAULT NULL,
  `frequency1_khz` varchar(255) DEFAULT NULL,
  `frequency2_khz` varchar(255) DEFAULT NULL,
  `record_date` date DEFAULT NULL,
  `creator_lastname` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `receiver_base1_mm` varchar(255) DEFAULT NULL,
  `receiver_base2_mm` varchar(255) DEFAULT NULL,
  `receiver_base3_mm` varchar(255) DEFAULT NULL,
  `changed_at` datetime DEFAULT NULL,
  `transmitter_base1_mm` varchar(255) DEFAULT NULL,
  `transmitter_base2_mm` varchar(255) DEFAULT NULL,
  `transmitter_base3_mm` varchar(255) DEFAULT NULL,
  `transmitter_base4_mm` varchar(255) DEFAULT NULL,
  `transmitter_base5_mm` varchar(255) DEFAULT NULL,
  `additional_info` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `device_identification`
--

INSERT INTO `device_identification` (`id`, `device_type`, `nominal_diameter`, `transmitter_count`, `serial_number`, `case_number`, `length_mm`, `diameter_mm`, `upper_thread`, `lower_thread`, `frequency1_khz`, `frequency2_khz`, `record_date`, `creator_lastname`, `created_at`, `receiver_base1_mm`, `receiver_base2_mm`, `receiver_base3_mm`, `changed_at`, `transmitter_base1_mm`, `transmitter_base2_mm`, `transmitter_base3_mm`, `transmitter_base4_mm`, `transmitter_base5_mm`, `additional_info`) VALUES
(1, 'LWD', '120', '4', '109', '008-2024', '4200.00', '122.00', 'mk-90', 'mk-90', '399.00', '1960.00', '2025-06-02', 'Админ', '2025-06-02 22:03:22', '254', NULL, NULL, '2026-05-05 20:39:31', '471', '849', '1228', '1601', NULL, NULL),
(2, 'LWD', '120', '4', '108', '005-2024', '3920.00', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '2025-06-02', 'Литвинов Владислав Глебович', '2025-06-02 22:23:33', '254', NULL, NULL, '2026-04-16 10:36:04', '318', '698', '1074', '1463', NULL, NULL),
(3, 'LWD', '120', '4', '106', '003-2023', '3903.00', '120.00', 'МК-90', 'МК-90', '401.00', '2001.00', '2025-06-05', 'Литвинов Владислав Глебович', '2025-06-05 15:27:38', '254', NULL, NULL, '2026-04-16 10:28:24', '345', '720', '1100', '1480', NULL, NULL),
(4, 'LWD', '120', '4', '105', '002-2023', '4140.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '0000-00-00', 'Литвинов Владислав Глебович', '2025-06-05 16:38:34', '254', NULL, NULL, '2026-04-16 10:17:42', '345', '722', '1101', '1476', NULL, NULL),
(7, 'Автономный', '90', '5', '151001', '045-2023', NULL, NULL, NULL, NULL, NULL, NULL, '2025-09-12', 'Литвинов Владислав Глебович', '2025-09-12 10:50:34', '-', '', '', '2025-09-12 13:53:02', '-', '-', '-', '-', '-', 'Прибор собран по схеме индукторов из провода. Индукторы приемника мотались проводом 0.35, 13 витков один к одному с зазором в 3 толщины провода от края желоба. Индукторы передатчика мотались проводом 0.5, 6 витков с зазором в одну толщину провода между витками и от края желоба.'),
(8, 'Автономный', '90', '4', '415', '041-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '2025-11-05', 'Литвинов Владислав Глебович', '2025-11-05 13:19:40', '254', '', '', '2025-11-06 18:06:01', '470', '846', '1228', '1605', NULL, '!!!Внимание!!! размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(9, 'Автономный', '90', '4', '416', '045-2022', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '0000-00-00', 'Литвинов Владислав Глебович', '2025-11-05 13:25:20', '254', '', '', '2025-11-06 18:05:51', '470', '846', '1228', NULL, NULL, '!!!Внимание!!! размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(10, 'Автономный', '90', '4', '414', '036-2020', '4200.00', '90', 'МК-90', 'МК-90', '399.00', '1960.00', '2025-11-05', 'Литвинов Владислав Глебович', '2025-11-05 13:25:56', '254', '', '', '2025-11-06 18:06:21', '470', '846', '1228', NULL, NULL, '!!!Внимание!!! размеры, резьбы и частоты выставлены от балды и требует проверки и редактирования.'),
(11, 'Автономный', '90', '3', '199', '003-2022', '2222', '120', 'МК-90', 'МК-90', '399.00', '1960.00', '2025-11-07', 'Литвинов Владислав Глебович', '2025-11-10 08:27:06', '254', '', '', NULL, '511', '1023', '2048', '', '', 'размеры и частоты требуют исправления'),
(12, 'Картограф', '120', '5', '351002', '005-2025', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '2025-12-24', 'Литвинов Владислав Глебович', '2025-12-24 08:08:00', '111', '222', '333', '2025-12-24 11:08:58', '111', '222', '333', '444', '555', NULL),
(13, 'Картограф', '120', '5', '351001', '004-2025', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '0000-00-00', 'Литвинов Владислав Глебович', '2025-12-24 08:09:41', '111', '222', '333', NULL, '111', '222', '333', '444', '555', ''),
(14, 'LWD', '120', '4', '107', '004-2023', '', '', '', '', '', '', '2026-01-19', 'Набиуллин Ильнар Габдуллович', '2026-01-19 11:31:05', '', '', '', NULL, '', '', '', '', '', ''),
(15, 'LWD', '120', '3', '102', '003-2022', '3920.00', '120', 'МК-90', 'МК-90', '401', '2001', '2026-04-08', 'Литвинов Владислав Глебович', '2026-04-08 07:18:53', '252', '', '', '2026-04-08 11:12:27', '812', '1224', '0', '0', '0', 'Прибор переделан в обычный LWD-индукционник из старого картографа.'),
(16, 'Картограф', '90', '3', '434', '344', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '0000-00-00', 'Админ', '2026-04-26 08:24:18', '111', '222', '333', NULL, '111', '222', '333', '', '', ''),
(17, 'Картограф', '90', '5', '333', '3333', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '2026-04-27', 'Админ', '2026-04-26 08:25:41', '111', '222', '333', NULL, '111', '222', '333', '444', '555', ''),
(18, 'Картограф', '90', '5', '111', '1111', '2222', '120.00', 'mk-90', 'mk-90', '399.00', '1960.00', '2026-04-27', 'Админ', '2026-04-26 19:36:27', '111', '222', '333', NULL, '111', '222', '333', '444', '555', ''),
(19, 'LWD', '120', '4', '234', '239', '4140.00', '120.00', 'МК-90', 'МК-90', '399.00', '1960.00', '2026-05-05', 'Админ', '2026-05-04 13:58:56', '254', '', '', NULL, '345', '722', '1101', '1476', '', ''),
(20, 'Автономный', '90', '5', '233', '045-2023', '', '', '', '', '', '', '0000-00-00', 'Админ', '2026-05-04 14:15:32', '-', '', '', NULL, '-', '-', '-', '-', '-', '');

-- --------------------------------------------------------

--
-- Структура таблицы `inspection_data`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `inspection_data`;
CREATE TABLE `inspection_data` (
  `id` int NOT NULL,
  `inspection_date` date DEFAULT NULL,
  `inspection_result` text,
  `creator_surname` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 16:45
--

DROP TABLE IF EXISTS `messages`;
CREATE TABLE `messages` (
  `id` int NOT NULL,
  `sender_id` int NOT NULL,
  `receiver_id` int NOT NULL,
  `message` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_read` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0 = не прочитано, 1 = прочитано',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `sender_id`, `receiver_id`, `message`, `is_read`, `created_at`) VALUES
(1, 7, 29, 'Тест', 0, '2026-05-05 16:43:59'),
(2, 7, 42, 'тест', 1, '2026-05-05 16:44:14');

-- --------------------------------------------------------

--
-- Структура таблицы `production_discontinuation`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `production_discontinuation`;
CREATE TABLE `production_discontinuation` (
  `id` int NOT NULL,
  `discontinuation_date` date DEFAULT NULL,
  `creator_surname` varchar(255) DEFAULT NULL,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `production_discontinuation`
--

INSERT INTO `production_discontinuation` (`id`, `discontinuation_date`, `creator_surname`, `serial_number`, `case_number`, `created_at`) VALUES
(1, '2025-04-05', ' Администратор ', '109', '008-2024', '2025-06-02 22:10:55'),
(2, '2024-01-01', ' Администратор ', '108', '005-2024', '2025-06-02 22:34:57');

-- --------------------------------------------------------

--
-- Структура таблицы `repair_data`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 17:40
--

DROP TABLE IF EXISTS `repair_data`;
CREATE TABLE `repair_data` (
  `id` int NOT NULL,
  `repair_reason` text,
  `failure_reason` text,
  `admission_date` date DEFAULT NULL,
  `release_date` date DEFAULT NULL,
  `actions_description` text,
  `repair_creator` varchar(255) DEFAULT NULL,
  `creator_id` int DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `repair_data`
--

INSERT INTO `repair_data` (`id`, `repair_reason`, `failure_reason`, `admission_date`, `release_date`, `actions_description`, `repair_creator`, `creator_id`, `created_at`, `serial_number`, `case_number`) VALUES
(1, 'В ходе испытаний мокрого индуктора произошёл выход из строя 4-ого передатчика', 'Сгорел выходной мост индуктора', '2025-04-15', '2025-06-04', 'Замена платы 4-ого передатчика. Настройка метрологии. Поверка на кольцах, прогрев.', ' Администратор ', 7, '2025-06-02 22:14:25', '109', '008-2024'),
(2, 'Отказал на скважине при попытке считать данные. Были сохранены данные предыдущей скважины.', 'Короткое замыкание по цепи батареи.', '2025-05-10', '2025-06-02', 'Ремонт транзитной платы №2, замена верхних экранов передающих индукторов, прогрев кольца.', ' Администратор ', 7, '2025-06-02 22:40:39', '108', '005-2024'),
(3, 'не могли вычитать данные на скважине. ', 'На транзитной плате вышел из строя керамический конденсатор на линии питания', '2025-05-12', '2025-06-05', 'произведён ремонт транзитной платы', 'Литвинов Владислав Глебович', 26, '2025-06-05 15:46:20', '108', '005-2024'),
(4, 'В скважине Т3_400 фаза намного смещена на 5-6 градусов относительно ожидаемой величины.\r\nТ4_2000 нарушен порядок. Кольца проходит успешно.', '', '2025-06-05', '2025-07-10', ' Заменены провода индукторов передатчиков.\r\n Экранирование провода с змеиной оплётки переделано на трубки на всех индукторах.\r\n Экраны индукторов заменены с тонких текстолитовых на полиамидные, подключение экранов к земле реализовано при помощи медных полос отожжённых в середине с предварительным лужением хвостов.\r\n Прописан новый воздух', 'Литвинов Владислав Глебович', 26, '2025-06-05 16:25:55', '106', '003-2023'),
(10, 'Перепрошивка на новые частоты (399, 1960) калибровка.', 'Обнаружена неисправность аварийного разъема.', '2025-06-05', '2025-06-06', '', 'Литвинов Владислав Глебович', 26, '2025-06-09 07:34:48', '105', '002-2023'),
(13, 'Показания не соответствовали ожидаемым характеристикам. отсутствует повторяемость показаний спуск-подъем. Предполагаемая причина направленная характеристика приборов', '', '2025-10-06', '2025-11-02', 'Перемотка приёмных индукторов (2х5 витков эмальпровода 0,2 мм);\r\n экранирование запитки приёмных индуктрров медными и ферритовыми трубками; \r\nустановка синфазных дросселей и Y-конденсаторов 2х10 мкФ в линиях 6 В и 24 В на входе транзитной платы Т4.', 'Литвинов Владислав Глебович', 26, '2025-11-06 15:13:22', '414', '036-2020'),
(14, 'Показания не соответствовали ожидаемым характеристикам. отсутствует повторяемость показаний спуск-подъем. Предполагаемая причина направленная характеристика приборов', '', '2025-10-06', '2025-11-02', 'Перемотка приёмных индукторов (2х5 витков эмальпровода 0,2 мм);\r\n экранирование запитки приёмных индуктрров медными и ферритовыми трубками; \r\nустановка синфазных дросселей и Y-конденсаторов 2х10 мкФ в линиях 6 В и 24 В на входе транзитной платы Т4.', 'Литвинов Владислав Глебович', 26, '2025-11-06 15:14:23', '415', '041-2022'),
(15, 'Показания не соответствовали ожидаемым характеристикам. отсутствует повторяемость показаний спуск-подъем. Предполагаемая причина направленная характеристика приборов', '', '2025-10-06', '2025-11-02', 'Перемотка приёмных индукторов (2х5 витков эмальпровода 0,2 мм);\r\n экранирование запитки приёмных индуктрров медными и ферритовыми трубками; \r\nустановка синфазных дросселей и Y-конденсаторов 2х10 мкФ в линиях 6 В и 24 В на входе транзитной платы Т4.', 'Литвинов Владислав Глебович', 26, '2025-11-06 15:15:04', '416', '045-2022'),
(16, 'не читался с аварийного разъёма', 'не качественный контакт в аварийном разъёме', '2025-10-06', '2025-11-02', 'почищен разъём, проверено качество связи в обход оного, иных неисправностей не обнаружено.', 'Литвинов Владислав Глебович', 26, '2025-11-10 08:33:31', '199', '003-2022'),
(17, 'Отказ в скважине.', 'Замыкание по линии +-16В', '2025-10-21', '2025-10-31', 'Ремонт проведен в Октябрьском. Перебило оба провода под передатчиком №1. Разобрали Т1, заменили все провода, проходящие\r\nЧерез Т-1, немного расширили пазы возле индуктора. Всё восстановили, залили компаундом. \r\nСобрали зонд, прописали воздух в цеху и КИС. От кипа без замечаний', 'Набиуллин Ильнар Габдуллович', 24, '2025-11-21 03:34:17', '105', '002-2023'),
(18, '---', '---', '2025-09-01', '2026-01-19', 'Комплекс действий по замене плат и индукторов.', 'Литвинов Владислав Глебович', 26, '2025-12-24 08:14:14', '108', '005-2024'),
(19, 'Отказ передатчика №3', 'Проблема в плате передатчика', '2026-01-19', '2026-01-19', 'Попросили отправить в Воронеж для полной переделки', 'Набиуллин Ильнар Габдуллович', 24, '2026-01-19 11:28:19', '106', '003-2023'),
(20, 'Отказ ИК в открытом стволе, 30 м из 990м. Акселерометры работали', 'Вероятная причина в шине Enable, т.к. произошло обнуление фрейма.', '2026-01-19', '2026-01-23', 'Причина была в модуле БП. Упало напряжение.', 'Набиуллин Ильнар Габдуллович', 24, '2026-01-19 11:33:49', '107', '004-2023'),
(21, 'Отказ третьего передатчика. Рекламация КИП на точность измерений.', 'выработка ресурса текущей конструкции.', '2026-01-24', '2026-02-06', 'Полная переборка. Замена плат, проводниковых линий, переделка индукторов.', 'Литвинов Владислав Глебович', 26, '2026-01-30 07:45:26', '106', '003-2023'),
(22, 'Короткое замыкание по +-16В', 'КЗ в керамическом конденсаторе С7 10мкф на транзитной плате передатчика Т2.', '2026-02-16', '2026-02-17', 'Замена конденсатора. Тестовая запись. Потребление в норме.', 'Набиуллин Ильнар Габдуллович', 24, '2026-02-17 06:04:25', '105', '002-2023'),
(23, 'Отписал 9 часов и начал писать нули, затем работа восстановилась. Акселерометры писали весь интервал.', 'Найдены 2 проблемы в плате MCU. Питание +5В нестабильно скачет от 3,6 до 4,2В. Про прогреве платы феном до 60гр 3.3В падает до 2.5В. Обнаружил замыкание танталового конденсатора С5 22*16В.', '2026-03-17', '2026-03-19', 'Пропайка микросхемы DC-DC канала 5В, напряжение стало стабильным 4,78В. Замена танталового конденсатора С5. Прогрев платы до 90гр, всё нормально. По просьбе Петра выпаял резисторы R905 3.3к на всех каналах.', 'Набиуллин Ильнар Габдуллович', 24, '2026-03-19 03:47:54', '106', '003-2023'),
(24, 'Нет связи с прибором, не смогли считать материал', 'Вышел из строя клапан SN74LVC1T45 на линии 1W и резистор 51Ом на плате управления', '2026-03-30', '2026-04-02', 'Замена микросхемы и резистора. Залита новая прошивка на плату управления и на ЦК с бутлодером.', 'Набиуллин Ильнар Габдуллович', 24, '2026-04-01 04:24:14', '107', '004-2023'),
(25, 'Вывод картографа этого типа из эксплуатации.', '', '2026-02-24', '2026-04-09', 'Произведена полная переборка прибора. Установка плат нового типа. укладка коммуникаций с применением латунных трубок большого диаметра и медных трубок малого диаметра для экранирования линий DDS, а так же линий соединяющих транзитные платы с разъемами. Индукторы переделаны из ленточных в проводные без изменения текапиковых вставок, передатчики содержат 4 витка проводом сечением 0,5. приёмники выполнены одним витком экранированного провода.', 'Литвинов Владислав Глебович', 26, '2026-04-08 07:30:28', '102', '003-2022'),
(26, 'Короткое замыкание по линии +-16В', 'КЗ в керамическом конденсаторе С14 на транзитной плате передатчика Т2.', '2026-04-13', '2026-04-16', 'Замена всех керамических конденсаторов 10мк*50В на всех транзитных платах, в том числе и на плате Олега. Обновление ПО платы Олега и ЦК под бутлоадер.', 'Набиуллин Ильнар Габдуллович', 24, '2026-04-16 04:40:42', '105', '002-2023'),
(27, 'сломался передатчик!', '', '2026-04-23', NULL, '', 'Админ', 7, '2026-04-26 08:26:39', '333', '3333');

-- --------------------------------------------------------

--
-- Структура таблицы `repair_data_history`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 17:40
--

DROP TABLE IF EXISTS `repair_data_history`;
CREATE TABLE `repair_data_history` (
  `history_id` int NOT NULL,
  `repair_data_id` int NOT NULL,
  `repair_reason` text,
  `failure_reason` text,
  `admission_date` date DEFAULT NULL,
  `release_date` date DEFAULT NULL,
  `actions_description` text,
  `changed_by_user_id` int DEFAULT NULL,
  `changed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `repair_data_history`
--

INSERT INTO `repair_data_history` (`history_id`, `repair_data_id`, `repair_reason`, `failure_reason`, `admission_date`, `release_date`, `actions_description`, `changed_by_user_id`, `changed_at`) VALUES
(3, 10, 'Перепрошивка на новые частоты (399, 1960) калибровка. Обнаружена неисправность аварийного разъема.', '', '2025-06-05', '0000-00-00', 'проведен ремонт передатчика', 7, '2025-06-09 16:30:26'),
(4, 10, 'Перепрошивка на новые частоты (399, 1960) калибровка.', 'Обнаружена неисправность аварийного разъема.', '2025-06-05', NULL, '', 26, '2025-06-10 07:35:36'),
(5, 10, 'Перепрошивка на новые частоты (399, 1960) калибровка.', 'Обнаружена неисправность аварийного разъема.', '2025-06-05', NULL, '', 26, '2025-06-10 07:47:24'),
(6, 4, 'В скважине Т3_400 фаза намного смещена на 5-6 градусов относительно ожидаемой величины.\r\nТ4_2000 нарушен порядок. Кольца проходит успешно.', '', '2025-06-05', '0000-00-00', 'В работе.', 26, '2025-07-09 10:57:28'),
(7, 20, 'Отказ ИК в открытом стволе, 30 м из 990м. Акселерометры работали', 'Вероятная причина в шине Enable, т.к. произошло обнуление фрейма.', '2026-01-19', NULL, '', 24, '2026-01-26 04:39:38'),
(8, 23, 'Отписал 9 часов и начал писать нули, затем работа восстановилась. Акселерометры писали весь интервал.', 'Найдены 2 проблемы в плате MCU. Питание +5В нестабильно скачет от 3,6 до 4,2В. Про прогреве платы феном до 60гр 3.3В падает до 2.5В. Обнаружил замыкание танталового конденсатора С5 22*16В.', '2026-03-17', '2026-03-19', 'Пропайка микросхемы DC-DC канала 5В, напряжение стало стабильным 4,78В. Замена танталового конденсатора С5. Прогрев платы до 90гр, всё нормально.', 24, '2026-03-19 09:05:57'),
(9, 22, 'Короткое замыкание по +-16В', 'КЗ в керамическом конденсаторе С7 1мкф на транзитной плате передатчика Т2.', '2026-02-16', '2026-02-17', 'Замена конденсатора. Тестовая запись. Потребление в норме.', 24, '2026-04-16 04:36:32'),
(10, 27, 'сломался передатчик', '', '2026-04-23', NULL, '', 7, '2026-04-26 08:26:49'),
(11, 24, 'Нет связи с прибором, не смогли считать материал', 'Вышел из строя клапан SN74LVC1T45 на линии 1W и резистор 51Ом на плате управления', '2026-03-30', '2026-04-01', 'Замена микросхемы и резистора. Залита новая прошивка на плату управления и на ЦК с бутлодером.', 7, '2026-05-04 13:57:18'),
(12, 1, 'В ходе испытаний мокрого индуктора произошёл выход из строя 4-ого передатчика', 'Сгорел выходной мост индуктора', '2025-04-15', '2025-06-02', 'Замена платы 4-ого передатчика. Настройка метрологии. Поверка на кольцах, прогрев. ', 7, '2026-05-05 15:12:07'),
(13, 1, 'В ходе испытаний мокрого индуктора произошёл выход из строя 4-ого передатчика', 'Сгорел выходной мост индуктора', '2025-04-15', '2025-06-04', 'Замена платы 4-ого передатчика. Настройка метрологии. Поверка на кольцах, прогрев.', 7, '2026-05-05 15:12:16');

-- --------------------------------------------------------

--
-- Структура таблицы `termination_data`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `termination_data`;
CREATE TABLE `termination_data` (
  `id` int NOT NULL,
  `termination_date` date DEFAULT NULL,
  `termination_reason` text,
  `creator_surname` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `serial_number` varchar(255) DEFAULT NULL,
  `case_number` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Структура таблицы `testing_data`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `testing_data`;
CREATE TABLE `testing_data` (
  `id` int NOT NULL,
  `serial_number` varchar(50) NOT NULL,
  `case_number` varchar(50) NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `creator` varchar(255) NOT NULL,
  `temperature_test` text,
  `vibration_test` text,
  `noise_sko_x1_400` float DEFAULT NULL,
  `noise_sko_y1_400` float DEFAULT NULL,
  `noise_sko_z1_400` float DEFAULT NULL,
  `noise_sko_x2_400` float DEFAULT NULL,
  `noise_sko_y2_400` float DEFAULT NULL,
  `noise_sko_z2_400` float DEFAULT NULL,
  `noise_sko_x1_2000` float DEFAULT NULL,
  `noise_sko_y1_2000` float DEFAULT NULL,
  `noise_sko_z1_2000` float DEFAULT NULL,
  `noise_sko_x2_2000` float DEFAULT NULL,
  `noise_sko_y2_2000` float DEFAULT NULL,
  `noise_sko_z2_2000` float DEFAULT NULL,
  `mds_transmitter_1_400` float DEFAULT NULL,
  `mds_transmitter_2_400` float DEFAULT NULL,
  `mds_transmitter_3_400` float DEFAULT NULL,
  `mds_transmitter_4_400` float DEFAULT NULL,
  `mds_transmitter_5_400` float DEFAULT NULL,
  `mds_transmitter_1_2000` float DEFAULT NULL,
  `mds_transmitter_2_2000` float DEFAULT NULL,
  `mds_transmitter_3_2000` float DEFAULT NULL,
  `mds_transmitter_4_2000` float DEFAULT NULL,
  `mds_transmitter_5_2000` float DEFAULT NULL,
  `second_harmonic_1_400` float DEFAULT NULL,
  `second_harmonic_2_400` float DEFAULT NULL,
  `second_harmonic_3_400` float DEFAULT NULL,
  `second_harmonic_4_400` float DEFAULT NULL,
  `second_harmonic_5_400` float DEFAULT NULL,
  `second_harmonic_1_2000` float DEFAULT NULL,
  `second_harmonic_2_2000` float DEFAULT NULL,
  `second_harmonic_3_2000` float DEFAULT NULL,
  `second_harmonic_4_2000` float DEFAULT NULL,
  `second_harmonic_5_2000` float DEFAULT NULL,
  `third_harmonic_1_400` float DEFAULT NULL,
  `third_harmonic_2_400` float DEFAULT NULL,
  `third_harmonic_3_400` float DEFAULT NULL,
  `third_harmonic_4_400` float DEFAULT NULL,
  `third_harmonic_5_400` float DEFAULT NULL,
  `third_harmonic_1_2000` float DEFAULT NULL,
  `third_harmonic_2_2000` float DEFAULT NULL,
  `third_harmonic_3_2000` float DEFAULT NULL,
  `third_harmonic_4_2000` float DEFAULT NULL,
  `third_harmonic_5_2000` float DEFAULT NULL,
  `non_harmonic_components_1_400` float DEFAULT NULL,
  `non_harmonic_components_2_400` float DEFAULT NULL,
  `non_harmonic_components_3_400` float DEFAULT NULL,
  `non_harmonic_components_4_400` float DEFAULT NULL,
  `non_harmonic_components_5_400` float DEFAULT NULL,
  `non_harmonic_components_1_2000` float DEFAULT NULL,
  `non_harmonic_components_2_2000` float DEFAULT NULL,
  `non_harmonic_components_3_2000` float DEFAULT NULL,
  `non_harmonic_components_4_2000` float DEFAULT NULL,
  `non_harmonic_components_5_2000` float DEFAULT NULL,
  `phase_difference_drift_1_400` float DEFAULT NULL,
  `phase_difference_drift_2_400` float DEFAULT NULL,
  `phase_difference_drift_3_400` float DEFAULT NULL,
  `phase_difference_drift_4_400` float DEFAULT NULL,
  `phase_difference_drift_5_400` float DEFAULT NULL,
  `phase_difference_drift_1_2000` float DEFAULT NULL,
  `phase_difference_drift_2_2000` float DEFAULT NULL,
  `phase_difference_drift_3_2000` float DEFAULT NULL,
  `phase_difference_drift_4_2000` float DEFAULT NULL,
  `phase_difference_drift_5_2000` float DEFAULT NULL,
  `test_result` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Структура таблицы `tolerances_autonomous`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `tolerances_autonomous`;
CREATE TABLE `tolerances_autonomous` (
  `id` int NOT NULL,
  `parameter` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `frequency` int NOT NULL,
  `column_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `min_value` decimal(10,2) DEFAULT NULL,
  `max_value` decimal(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tolerances_cartographer`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `tolerances_cartographer`;
CREATE TABLE `tolerances_cartographer` (
  `id` int NOT NULL,
  `parameter` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `frequency` int NOT NULL,
  `column_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `min_value` decimal(10,2) DEFAULT NULL,
  `max_value` decimal(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tolerances_lwd`
--
-- Создание: Апр 26 2026 г., 08:23
--

DROP TABLE IF EXISTS `tolerances_lwd`;
CREATE TABLE `tolerances_lwd` (
  `id` int NOT NULL,
  `parameter` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `frequency` int NOT NULL,
  `column_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `min_value` decimal(10,2) DEFAULT NULL,
  `max_value` decimal(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `uploaded_files`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 17:40
--

DROP TABLE IF EXISTS `uploaded_files`;
CREATE TABLE `uploaded_files` (
  `id` int NOT NULL,
  `field_name` varchar(255) NOT NULL,
  `file_name` varchar(255) NOT NULL,
  `file_data` longblob NOT NULL,
  `serial_number` varchar(255) NOT NULL,
  `case_number` varchar(255) NOT NULL,
  `device_type` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--
-- Создание: Апр 26 2026 г., 08:23
-- Последнее обновление: Май 05 2026 г., 16:45
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `firstname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lastname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `middlename` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `is_admin` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `firstname`, `lastname`, `middlename`, `created_at`, `is_admin`) VALUES
(7, 'admin', '$2y$10$ll.3LQnGG34bUiU2PUCN6euaBhYNbYZjaYzTTzAIdJ0prLCOBHvX.', ' ', 'Админ', '', '2025-02-15 18:06:51', 1),
(23, 'Roman_Sh', '$2y$10$X4xXA4DUhvBRMNAgK37CzOV9Y6Z7mmyf3ZmBbxOC/8cNEXtuZldDu', 'Роман', 'Шарипов', 'Ильсурович', '2025-04-11 06:03:25', 0),
(24, 'Ilnar_N', '$2y$10$i.wGv7sTTMn/bkwpgUdPWOPjdTSvLoYreaoO6UM.OWHtQa0rAjS/u', 'Ильнар', 'Набиуллин', 'Габдуллович', '2025-04-11 06:07:57', 0),
(25, 'Peter_M', '$2y$10$LSFUXYNj27nvqXs3JlGzPex2L7mOZoOrnVDl2VntgIfgW3Wj74gBK', 'Пётр', 'Милых', 'Сергеевич', '2025-04-11 08:09:28', 1),
(26, 'Vladislav_L', '$2y$10$BbUKJURfoMGurVCCgw35SuDj52Dt9AQ9rQLO0g9qZF3fJjIcyv42S', 'Владислав', 'Литвинов', 'Глебович', '2025-04-11 08:12:59', 1),
(29, 'Andrey_B', '$2y$10$NIHuY50U3m6EdXrGVik/u.dBNCevLxdWum4dS4oZtTsz3TQWSv2fq', 'Андрей', 'Боев', 'Игоревич', '2025-04-13 08:03:51', 1),
(31, 'Sonilev', '$2y$10$42lYUD9HMuuZRd3amJ.gkeFTScBl0ppiSHphLuYJ7h7xa/fKhRgU2', 'Семен', 'Смирнов', 'Георгиевич', '2025-06-10 07:50:24', 0),
(32, 'Smirnov_SF', '$2y$10$E5uHsYFtxC3GJYWklqnAhe6VZeLiXky8b2/wQLAUqYxyP/SeY0nFS', 'Сергей', 'Смирнов', 'Федорович', '2025-06-10 11:43:17', 0),
(33, 'Saptarov_A', '$2y$10$s9FbDXK1j3CEGjBs2FaemetwigrtxD0Ke8Mf0ShT9wTyJfy7yvgfW', 'Артур', 'Саптаров', 'Ринатович', '2025-06-10 11:51:59', 0),
(34, 'Ziyazetdinov_A', '$2y$10$9wVjODQZjmmyuxVkyFP7.uNLpssnS.pW2XLenxPzBp4lpC0Ng0ckC', 'Альберт', 'Зиязетдинов', 'Халимович', '2025-06-10 19:10:26', 0),
(35, 'Sultanov_A', '$2y$10$xowxBCoelwEbhXnMXsKfw.fZCTGNjTnP14U7vpH4Kk4fGSjab1V1W', 'Алмаз', 'Султанов', 'Музавирович', '2025-06-17 06:21:51', 0),
(36, 'Legotin_L', '$2y$10$JwSRBPXJDHBtCK5plnAToOzY.RY2A.LFP6SUior4ubkYkpXWlsbjS', 'Леонид', 'Леготин', 'Георгиевич', '2025-06-17 06:24:20', 0),
(37, 'Sharipov_R', '$2y$10$e3ts.N7vHD7SS9daPYW8EuJMiabjc8HvJZBkfgIp6qRSme9zOxodC', 'Роман', 'Шарипов', 'Ильсурович', '2025-06-17 06:40:07', 0),
(38, 'Maganavetdinov_D', '$2y$10$PXrDRwGlfwciHF2fsKISoOTencbjlA5VpJD1OCeQ6B7KUthgEfLnK', 'Денис', 'Маганаветдинов', 'Равилевич', '2025-06-17 06:45:59', 0),
(39, 'Kryukov_D', '$2y$10$RiSe/3iCAXZzfNe7C.jPruwaVH03pZlKVlup7NnbHpiSU1IKYaFLS', 'Дмитрий', 'Крюков', 'Валерьевич', '2025-06-17 10:59:12', 0),
(40, 'Vasilev_A', '$2y$10$Hl3BWntkQ7iYnI1jJWuIOOYVJXzgqCkTxYAEZ4oOluSHJ/DKxdicG', 'Алексей', 'Васильев', 'Владимирович', '2025-11-20 14:36:42', 0),
(41, 'Repalov_V', '$2y$10$fX4YP3y5RtSsXjxLJBVfWuwnKnt5DcrK5Li7OaC58ndFwrtKhejcC', 'Валерий', 'Репалов', 'Леонидович', '2025-11-25 08:21:46', 0),
(42, 'ivanov_i', '$2y$10$Xs6sSleZG5RtVmtXtZzKceZyJnf4XDGKoZUA2Dat6hVMVoV8e2XgK', 'Иван', 'Иванов', 'Петрович', '2026-04-28 19:10:20', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `additional_data`
--
ALTER TABLE `additional_data`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `device_composition`
--
ALTER TABLE `device_composition`
  ADD PRIMARY KEY (`id`),
  ADD KEY `device_id` (`device_id`);

--
-- Индексы таблицы `device_composition_history`
--
ALTER TABLE `device_composition_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `device_id` (`device_id`);

--
-- Индексы таблицы `device_history`
--
ALTER TABLE `device_history`
  ADD PRIMARY KEY (`history_id`);

--
-- Индексы таблицы `device_identification`
--
ALTER TABLE `device_identification`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `inspection_data`
--
ALTER TABLE `inspection_data`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_sender` (`sender_id`),
  ADD KEY `idx_receiver` (`receiver_id`),
  ADD KEY `idx_receiver_read` (`receiver_id`,`is_read`);

--
-- Индексы таблицы `production_discontinuation`
--
ALTER TABLE `production_discontinuation`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `repair_data`
--
ALTER TABLE `repair_data`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_repair_data_creator_idx` (`creator_id`);

--
-- Индексы таблицы `repair_data_history`
--
ALTER TABLE `repair_data_history`
  ADD PRIMARY KEY (`history_id`),
  ADD KEY `repair_data_id` (`repair_data_id`),
  ADD KEY `changed_by_user_id` (`changed_by_user_id`);

--
-- Индексы таблицы `termination_data`
--
ALTER TABLE `termination_data`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `testing_data`
--
ALTER TABLE `testing_data`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tolerances_autonomous`
--
ALTER TABLE `tolerances_autonomous`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parameter_frequency` (`parameter`,`frequency`);

--
-- Индексы таблицы `tolerances_cartographer`
--
ALTER TABLE `tolerances_cartographer`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parameter_frequency` (`parameter`,`frequency`);

--
-- Индексы таблицы `tolerances_lwd`
--
ALTER TABLE `tolerances_lwd`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parameter_frequency` (`parameter`,`frequency`);

--
-- Индексы таблицы `uploaded_files`
--
ALTER TABLE `uploaded_files`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `additional_data`
--
ALTER TABLE `additional_data`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `device_composition`
--
ALTER TABLE `device_composition`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT для таблицы `device_composition_history`
--
ALTER TABLE `device_composition_history`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `device_history`
--
ALTER TABLE `device_history`
  MODIFY `history_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `device_identification`
--
ALTER TABLE `device_identification`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `inspection_data`
--
ALTER TABLE `inspection_data`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `production_discontinuation`
--
ALTER TABLE `production_discontinuation`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `repair_data`
--
ALTER TABLE `repair_data`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `repair_data_history`
--
ALTER TABLE `repair_data_history`
  MODIFY `history_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `termination_data`
--
ALTER TABLE `termination_data`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `testing_data`
--
ALTER TABLE `testing_data`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tolerances_autonomous`
--
ALTER TABLE `tolerances_autonomous`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tolerances_cartographer`
--
ALTER TABLE `tolerances_cartographer`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tolerances_lwd`
--
ALTER TABLE `tolerances_lwd`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `uploaded_files`
--
ALTER TABLE `uploaded_files`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `device_composition`
--
ALTER TABLE `device_composition`
  ADD CONSTRAINT `device_composition_ibfk_1` FOREIGN KEY (`device_id`) REFERENCES `device_identification` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `messages`
--
ALTER TABLE `messages`
  ADD CONSTRAINT `fk_messages_receiver` FOREIGN KEY (`receiver_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_messages_sender` FOREIGN KEY (`sender_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `repair_data`
--
ALTER TABLE `repair_data`
  ADD CONSTRAINT `fk_repair_data_creator` FOREIGN KEY (`creator_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `repair_data_history`
--
ALTER TABLE `repair_data_history`
  ADD CONSTRAINT `fk_repair_data_history_to_repair_data` FOREIGN KEY (`repair_data_id`) REFERENCES `repair_data` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_repair_history_to_users` FOREIGN KEY (`changed_by_user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
